---
kind: method
id: M:Autodesk.Revit.DB.FilePath.#ctor(System.String)
source: html/55a57737-1024-6912-540a-744a3a9fb90b.htm
---
# Autodesk.Revit.DB.FilePath.#ctor Method

Constructs a FilePath

## Syntax (C#)
```csharp
public FilePath(
	string path
)
```

## Parameters
- **path** (`System.String`) - The path to the file. This path does not
 have to be a full path; it can be relative.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null